# Tap
tap "homebrew/bundle"
tap "gromgit/fuse"
tap "jesseduffield/lazygit"
tap "romkatv/powerlevel10k"

# Git and Version Control
brew "bat"  # A clone of cat(1) with syntax highlighting and Git integration.
brew "fzf"  # Command-line fuzzy finder written in Go.
brew "gh"   # GitHub command-line tool.
brew "git"  # Distributed revision control system.

# File and Text Processing
brew "exa"      # A modern replacement for ls.
brew "gnu-sed"  # GNU implementation of the famous stream editor.
brew "jq"       # Lightweight and flexible command-line JSON processor.
brew "ripgrep"  # Search tool like grep and The Silver Searcher.
brew "parallel"               # Shell command parallelization utility.

# Performance and Benchmarking
brew "hyperfine"  # Command-line benchmarking tool.

# Development Tools
brew "neovim"                 # Ambitious Vim-fork focused on extensibility and agility.
brew "tmux"                   # Terminal multiplexer.
brew "k9s"                    # Kubernetes CLI to manage your clusters.
brew "tree"                   # Display directories as trees (with optional color/HTML output).
brew "zsh-autosuggestions"    # Fish-like fast/unobtrusive autosuggestions for Zsh.
brew "zsh-syntax-highlighting" # Fish shell-like syntax highlighting for Zsh.

# TS/JS
brew "nvm"                    # Manage multiple Node.js versions.
brew "pnpm"                   # Fast, disk space-efficient package manager.
brew "yarn"                   # JavaScript package manager.

# NTFS Support
brew "gromgit/fuse/ntfs-3g-mac"

# Utilities
brew "jesseduffield/lazygit/lazygit"
brew "romkatv/powerlevel10k/powerlevel10k"

# Window Managers
cask "amethyst"

# Containers
cask "docker"

# Web Browsers
cask "firefox"
cask "google-chrome"

# Terminal Emulators
cask "iterm2"

# Keyboard Customization
cask "karabiner-elements"

# Monitor Control
cask "monitorcontrol"

# Knowledge Base
cask "obsidian"

# Multimedia
cask "vlc"
