# Taps
tap "azure/functions"          # Azure Functions tap
tap "candid82/brew"            # Candid82 tap
tap "gromgit/fuse"             # Gromgit's fuse tap
tap "homebrew/bundle"          # Homebrew Bundle tap
tap "homebrew/cask-fonts"      # Homebrew Fonts tap
tap "homebrew/services"         # Homebrew Services tap
tap "jesseduffield/lazydocker" # LazyDocker tap
tap "jesseduffield/lazygit"    # LazyGit tap
tap "koekeishiya/formulae"      # Koekeishiya's formulae tap
tap "mongodb/brew"              # MongoDB tap
tap "osx-cross/arm"             # OSX Cross ARM tap
tap "osx-cross/avr"             # OSX Cross AVR tap
tap "oven-sh/bun"               # Oven.sh Bun tap
tap "qmk/qmk"                   # QMK tap
tap "romkatv/powerlevel10k"    # Powerlevel10k tap
tap "tursodatabase/tap"         # Turso Database tap
tap "yqrashawn/goku"            # Goku tap

# Development Tools and Languages
brew "ansible"                  # Configuration management and application deployment tool
brew "python@3.11"              # Python programming language
brew "azure-cli"                # Microsoft Azure Command-Line Interface
brew "cmake"                    # Cross-platform make
brew "exa"                      # Modern replacement for 'ls'
brew "fd"                       # Fast and user-friendly alternative to 'find'
brew "flyctl"                   # Fly.io CLI
brew "fnm"                      # Fast and simple Node.js version manager
brew "fzf"                      # Fuzzy finder for the command-line
brew "gh"                       # GitHub command-line tool
brew "git"                      # Distributed version control system
brew "go"                       # Open source programming language
brew "openjdk"                  # OpenJDK Java runtime
brew "gradle"                   # Build automation system
brew "hyperfine"                # Command-line benchmarking tool
brew "ios-deploy"               # Install and debug iOS apps
brew "jq"                       # Lightweight and flexible command-line JSON processor
brew "k9s"                      # Kubernetes CLI to manage your clusters
brew "krb5"                     # Network authentication protocol
brew "libimobiledevice"         # Library to communicate with iOS devices
brew "libpq"                    # PostgreSQL C library
brew "maven"                    # Build and project management tool
brew "neovim"                   # Vim-fork focused on extensibility and usability
brew "ninja"                    # Small build system for use with gyp or CMake
brew "opam"                     # OCaml package manager
brew "openssh"                  # OpenSSH client and server
brew "parallel"                 # Command-line CPU load balancer
brew "pillow"                   # Imaging library for Python
brew "pnpm"                     # Fast, disk space efficient package manager
brew "powerlevel10k"            # Zsh theme
brew "ripgrep"                  # Search tool like 'grep' and 'ack'
brew "stow"                     # Symlink farm manager
brew "tldr"                     # Simplified and community-driven man pages
brew "tmux"                     # Terminal multiplexer
brew "tree"                     # Display directory tree
brew "xcodegen"                 # Command-line tool that generates Xcode project files
brew "yarn"                     # JavaScript package manager
brew "zsh-autosuggestions"      # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting"  # Fish shell like syntax highlighting for Zsh

# Shell and Zsh Utilities
brew "gnu-sed"                  # GNU implementation of 'sed'
brew "stow"                     # Symlink farm manager
brew "zsh-autosuggestions"      # Fish-like autosuggestions for Zsh
brew "zsh-syntax-highlighting"  # Fish shell like syntax highlighting for Zsh

# Azure and Cloud Tools
brew "biome"                    # Bioinformatics workflow system
brew "azure/functions/azure-functions-core-tools@4" # Azure Functions Core Tools
brew "microsoft-azure-storage-explorer"             # Microsoft Azure Storage Explorer

# Git and GitHub Tools
brew "bat"                      # Cat clone with syntax highlighting
brew "git"                      # Distributed version control system
brew "gh"                       # GitHub command-line tool

# Database Tools
brew "castxml"                  # XML/XSD-to-C++ code generation
brew "libpq"                    # PostgreSQL C library
brew "mongodb/brew/mongodb-database-tools"  # MongoDB database tools

# Text Editors and IDEs
brew "neovim"                   # Vim-fork focused on extensibility and usability
cask "visual-studio-code"       # Visual Studio Code
cask "intellij-idea"            # IntelliJ IDEA
cask "webstorm"                 # WebStorm

# Terminal and Shell Enhancements
brew "cmatrix"                  # Console Matrix screensaver
brew "powerlevel10k"            # Zsh theme
brew "tldr"                     # Simplified and community-driven man pages
brew "yqrashawn/goku/goku"      # Dotfiles manager

# Command Line Productivity
brew "fd"                       # Fast and user-friendly alternative to 'find'
brew "ripgrep"                  # Search tool like 'grep' and 'ack'
brew "exa"                      # Modern replacement for 'ls'

# Networking and Security
brew "openvpn-connect"          # OpenVPN client
brew "wireguard-tools"          # WireGuard VPN tools

# Productivity and Miscellaneous
cask "obsidian"                 # Note-taking and knowledge management
cask "coconutbattery"           # Battery monitoring tool
cask "monitorcontrol"           # Adjust external monitor brightness
cask "qbittorrent"              # BitTorrent client
cask "steam"                    # Gaming platform
cask "vial"                     # Keyboard firmware for mechanical keyboards
cask "vlc"                      # Media player
cask "wezterm"                  # GPU-accelerated terminal emulator
cask "amethyst"                 # Window manager
cask "adobe-digital-editions"   # E-book reader

# Web Browsers
cask "brave-browser"            # Brave Browser
cask "firefox"                  # Mozilla Firefox

# Fonts
cask "font-hack-nerd-font"      # Nerd Fonts patched font

# Communication and Collaboration
cask "discord"                  # Chat and voice communication platform
cask "microsoft-teams"          # Collaboration platform
cask "slack"                    # Team collaboration and messaging

# Design and Creativity
cask "gimp"                     # GNU Image Manipulation Program
cask "inkscape"                 # Professional vector graphics editor

# Virtualization and Containers
cask "docker"                   # Containerization platform
cask "virtualbox"               # Virtualization software

# Gaming
cask "steam"                    # Gaming platform

# Visual Studio Code Extensions
vscode "asvetliakov.vscode-neovim"                        # Neovim integration
vscode "ms-azure-devops.azure-pipelines"                  # Azure Pipelines integration
vscode "ms-vscode.azure-account"                         # Azure Account integration
vscode "TomAustin.azure-devops-yaml-pipeline-validator"  # YAML Pipeline Validator
