brew "stow"
brew "bat"
brew "cmake"
brew "fnm"
brew "fzf"
brew "git"
brew "go"
brew "hyperfine"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "ollama"
brew "ripgrep"
brew "fd"
brew "stow"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "wezterm"
cask "karabiner-elements"
cask "amethyst"
cask "obsidian"
cask "brave-browser"
cask "docker"
cask "insomnia"
